app/controllers/user_queries_controller.rb

  def index
    @user_queries = UserQuery.all
---
SELECT "user_queries".* FROM "user_queries"

  def show
    st = "%#{@user_query.search_text}%"
    @actual_reviews = @user_query.reviews.where('LOWER(content) LIKE LOWER(?)', st)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_query_id" = ?  [["user_query_id", 20]]

  def create
    @user_query = UserQuery.new(user_query_params)

    respond_to do |format|
      if @user_query.save
---
INSERT INTO "user_queries" ("product_id", "search_text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 45863472], ["search_text", "press"], ["created_at", "2016-01-27 10:12:52.623927"], ["updated_at", "2016-01-27 10:12:52.623927"]]

    def set_user_query
      @user_query = UserQuery.find(params[:id])
---
SELECT  "user_queries".* FROM "user_queries" WHERE "user_queries"."id" = ? LIMIT 1  [["id", 1]]