app/views/user_queries/show.html.haml

%br
= @user_query.reviews.each do |review|
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_query_id" = ?  [["user_query_id", 20]]